jobs/20260720-154153-luqia-vllm-smoke-5min-ganymede/slurm-249394.out

===== job_info =====
time=2026-07-20T15:44:42+02:00
hostname=ganymede
whoami=chjing
HOME=/data/users/chjing
SLURM_JOB_ID=249394
SLURM_JOB_NODELIST=ganymede
SLURM_JOB_GPUS=1
CUDA_VISIBLE_DEVICES_initial=1
python_bin=/data/users/chjing/miniforge3/envs/cuda-env/bin/python
vllm_bin=/data/users/chjing/miniforge3/envs/cuda-env/bin/vllm
bench_duration_s=300
target_sm_mhz=990
output_dir=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260720-154153-luqia-vllm-smoke-5min-ganymede/vllm_smoke_results
vllm_version=0.15.1
torch_version=2.9.1+cu128
cuda_available=True
index, name, memory.total [MiB], driver_version
1, NVIDIA L4, 23034 MiB, 595.71.05
monitor_pid=443358

===== set_locked_gpu_clock =====
pre_reset_command=sudo nvidia-smi -i 0 -rgc
All done.
set_command=sudo nvidia-smi -i 0 -lgc 990,990
GPU clocks set to "(gpuClkMin 990, gpuClkMax 990)" for GPU 00000000:0D:00.0

Warning: persistence mode is disabled on device 00000000:0D:00.0. See the Known Issues section of the nvidia-smi(1) man page for more information. Run with [--help | -h] switch to get more information on how to enable persistence mode.
All done.
set_frequency_rc=0
index, name, clocks.current.sm [MHz], clocks.max.graphics [MHz]
1, NVIDIA L4, 210 MHz, 2040 MHz

===== start_vllm_server =====
CUDA_VISIBLE_DEVICES=1
model=mistralai/Mistral-7B-v0.1
port=26394
server_pid=443379
waiting_for_server_s=5
waiting_for_server_s=10
waiting_for_server_s=15
waiting_for_server_s=20
waiting_for_server_s=25
waiting_for_server_s=30
waiting_for_server_s=35
waiting_for_server_s=40
waiting_for_server_s=45
waiting_for_server_s=50
waiting_for_server_s=55
waiting_for_server_s=60
waiting_for_server_s=65
server_ready=true
server_ready_after_s=65
{"object":"list","data":[{"id":"mistralai/Mistral-7B-v0.1","object":"model","created":1784555154,"owned_by":"vllm","root":"mistralai/Mistral-7B-v0.1","parent":null,"max_model_len":4096,"permission":[{"id":"modelperm-8ea9679a74a2ab83","object":"model_permission","created":1784555154,"allow_create_engine":false,"allow_sampling":true,"allow_logprobs":true,"allow_search_indices":false,"allow_view":true,"allow_fine_tuning":false,"organization":"*","group":null,"is_blocking":false}]}]}
===== vllm_bench_5min =====
bench_start=2026-07-20T15:45:54+02:00
bench_iter=1 remaining_s=300 start=2026-07-20T15:45:54+02:00
bench_iter=1 rc=0 end=2026-07-20T15:47:32+02:00
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7680a7e71000>, seed=0, num_prompts=120, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:26394', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=5, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-98596bed-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-20 15:46:04 [datasets.py:612] Sampling input_len from [1023, 1023] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:08<00:00,  1.64s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 120/120 [01:19<00:00,  1.52it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     120       
Failed requests:                         0         
Maximum request concurrency:             64        
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  79.08     
Total input tokens:                      122760    
Total generated tokens:                  15360     
Request throughput (req/s):              1.52      
Output token throughput (tok/s):         194.24    
Peak output token throughput (tok/s):    405.00    
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          1746.67   
---------------Time to First Token----------------
Mean TTFT (ms):                          3861.20   
Median TTFT (ms):                        1701.56   
P99 TTFT (ms):                           10010.54  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          162.23    
Median TPOT (ms):                        178.88    
P99 TPOT (ms):                           194.37    
---------------Inter-token Latency----------------
Mean ITL (ms):                           162.23    
Median ITL (ms):                         109.03    
P99 ITL (ms):                            588.72    
==================================================
bench_iter=2 remaining_s=201 start=2026-07-20T15:47:33+02:00
bench_iter=2 rc=0 end=2026-07-20T15:49:12+02:00
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x73bd946c5000>, seed=0, num_prompts=120, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:26394', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=5, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-812c7df2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-20 15:47:42 [datasets.py:612] Sampling input_len from [1023, 1023] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:08<00:00,  1.63s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 120/120 [01:19<00:00,  1.50it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     120       
Failed requests:                         0         
Maximum request concurrency:             64        
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  79.91     
Total input tokens:                      122760    
Total generated tokens:                  15360     
Request throughput (req/s):              1.50      
Output token throughput (tok/s):         192.21    
Peak output token throughput (tok/s):    405.00    
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          1728.37   
---------------Time to First Token----------------
Mean TTFT (ms):                          4139.00   
Median TTFT (ms):                        1663.07   
P99 TTFT (ms):                           10993.81  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          165.52    
Median TPOT (ms):                        183.14    
P99 TPOT (ms):                           197.96    
---------------Inter-token Latency----------------
Mean ITL (ms):                           165.52    
Median ITL (ms):                         109.66    
P99 ITL (ms):                            600.47    
==================================================
bench_iter=3 remaining_s=102 start=2026-07-20T15:49:12+02:00
bench_iter=3 rc=124 end=2026-07-20T15:50:54+02:00
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76beaabe1000>, seed=0, num_prompts=120, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:26394', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=5, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-02acc8c5-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-20 15:49:25 [datasets.py:612] Sampling input_len from [1023, 1023] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:08<00:00,  1.64s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
 98%|█████████▊| 118/120 [01:19<00:00,  4.11it/s]Traceback (most recent call last):
  File "/data/users/chjing/miniforge3/envs/cuda-env/bin/vllm", line 8, in <module>
    sys.exit(main())
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/site-packages/vllm/entrypoints/cli/main.py", line 73, in main
    args.dispatch_function(args)
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/site-packages/vllm/entrypoints/cli/benchmark/serve.py", line 21, in cmd
    main(args)
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/site-packages/vllm/benchmarks/serve.py", line 1507, in main
    return asyncio.run(main_async(args))
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/asyncio/runners.py", line 44, in run
    return loop.run_until_complete(main)
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/asyncio/base_events.py", line 636, in run_until_complete
    self.run_forever()
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/asyncio/base_events.py", line 603, in run_forever
    self._run_once()
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/asyncio/base_events.py", line 1871, in _run_once
    event_list = self._selector.select(timeout)
  File "/data/users/chjing/miniforge3/envs/cuda-env/lib/python3.10/selectors.py", line 469, in select
    fd_event_list = self._selector.poll(timeout, max_ev)
KeyboardInterrupt
bench_reached_300s_deadline=true
bench_end=2026-07-20T15:50:54+02:00
bench_elapsed_s=300
bench_rc=0

===== post_bench_validation =====
server_alive_after_bench=true
{"object":"list","data":[{"id":"mistralai/Mistral-7B-v0.1","object":"model","created":1784555454,"owned_by":"vllm","root":"mistralai/Mistral-7B-v0.1","parent":null,"max_model_len":4096,"permission":[{"id":"modelperm-957aa3790ae7ecaf","object":"model_permission","created":1784555454,"allow_create_engine":false,"allow_sampling":true,"allow_logprobs":true,"allow_search_indices":false,"allow_view":true,"allow_fine_tuning":false,"organization":"*","group":null,"is_blocking":false}]}]}
final_bench_elapsed_s=300
final_bench_rc=0

===== cleanup =====
stopping_vllm_server_pid=443379
stopping_gpu_monitor_pid=443358
reset_clock_command=sudo nvidia-smi -i 0 -rgc
All done.
job_exit_rc=0